templates/intermixingPhaseChangeFoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (8.07 0 0);

boundaryField
{
    airinlet
    {
       // type                flowRateInletVelocity;
       // volumetricFlowRate  0.002;
       // extrapolateProfile  yes;
       // value               uniform (0 0 0);
        type            surfaceNormalFixedValue;
        refValue        uniform -15.32;
    }

    waterinlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }


    model
    {
        type            noSlip;
    }


    symmetry
    {
        type            symmetry;
    }

    side
    {
        type            slip;
       // type            pressureInletOutletVelocity;
       // value           $internalField;
    }
}


// ************************************************************************* //
