templates/intermixingPhaseChangeFoam/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 68400;

boundaryField
{
    side
    {
        type            zeroGradient;
       // type            totalPressure;
       // p0              $internalField;
    }

    inlet
    {
       // type            zeroGradient;
        type            fixedFluxPressure;
        value           $internalField;
    }

    outlet
    {
        type            fixedValue;
        value           $internalField;
    }

    model
    {
        type            zeroGradient;
       // type            fixedFluxPressure;
       // value           $internalField;
    }

    symmetry
    {
        type            symmetry;
    }

}

// ************************************************************************* //
