templates/intermixingPhaseChangeFoam/0/alpha.vapour
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.other;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    airinlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    waterinlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    model
    {
        type            zeroGradient;
    }

    side
    {
        type            zeroGradient;
    }

    symmetry
    {
        type            symmetry;
    }

    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
