templates/intermixingPhaseChangeFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    "cellDisplacement.*"
    {
        solver          PCG;
        preconditioner  DIC;

        tolerance       1e-06;
        relTol          0;
        maxIter         100;
    }

    "alpha.*"
    {
        nAlphaCorr      1;
        nAlphaSubCycles 2;
        cAlpha          1;
        icAlpha         0;

        //MULESCorr       yes;
        nLimiterIter    5;
        smoothLimiter   0;
        //alphaApplyPrevCorr  no;

        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0;
        //nSweeps         1;
    }

    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-9;
        relTol          0;
    }

    p_rgh
    {
        solver          GAMG;
        tolerance       1e-8;//1e-07;
        relTol          0.05;//0.1;//0.05;
        smoother        DICGaussSeidel;//GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        //nFinestSweeps   2;
        cacheAgglomeration on;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        maxIter         50;//
    }

    p_rghFinal
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-6;//1e-07;
            relTol          0;
            nVcycles        2;
            smoother        DICGaussSeidel;//GaussSeidel;
            nPreSweeps      0;
            nPostSweeps     2;
            nFinestSweeps   2;
            cacheAgglomeration off;//on;
            nCellsInCoarsestLevel 10;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }
        tolerance       1e-08;
        relTol          0;
        maxIter         50;//80;//20;
    }

    "(U|k|omega|epsilon).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0;
    }

    Phi
    {
        $p_rgh;
        relTol          0;
    };
}

potentialFlow
{
    nNonOrthogonalCorrectors   3;
}

PIMPLE
{
    momentumPredictor   no;
    nOuterCorrectors    2;
    nCorrectors         2;
    nNonOrthogonalCorrectors 3;

    ddtCorr                    no;
    correctPhi                 no;
    massFluxInterpolation      no;

    moveMeshOuterCorrectors no;
    turbOnFinalIterOnly no;

    oversetAdjustPhi    no;

}

relaxationFactors
{
    fields
    {
    }
    equations
    {
            ".*" 1.;
    }
}

cache
{
        grad(U);
}

// ************************************************************************* //
